experiment/results/sglang/qwen3.5-122b/20260405_123855_sglang/benchmark.log
[INFO] Config saved to /root/autodl-tmp/workspace/experiment/results/sglang/qwen3.5-122b/20260405_123855_sglang/config.json
[INFO] Waiting for server to be ready (warmup may be running)...
[INFO] Server is ready (warmup complete)
[INFO] Model ID: /root/autodl-tmp/models/qwen35_122b

>>> ============================================
>>> Benchmark RR=0.05 req/s
>>> ============================================
benchmark_args=Namespace(backend='sglang', base_url='http://localhost:8000', host='0.0.0.0', port=None, dataset_name='sharegpt', dataset_path='/root/autodl-tmp/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', model='/root/autodl-tmp/models/qwen35_122b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=4096, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.05, use_trace_timestamps=False, max_concurrency=None, output_file='/root/autodl-tmp/workspace/experiment/results/sglang/qwen3.5-122b/20260405_123855_sglang/rr_0.05/result.json', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url='http://localhost:8000', host='0.0.0.0', port=30000, dataset_name='sharegpt', dataset_path='/root/autodl-tmp/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', model='/root/autodl-tmp/models/qwen35_122b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=4096, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.05, use_trace_timestamps=False, max_concurrency=None, output_file='/root/autodl-tmp/workspace/experiment/results/sglang/qwen3.5-122b/20260405_123855_sglang/rr_0.05/result.json', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 32681
#Output tokens: 25126
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 100/100 [31:24<00:00, 18.84s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    0.05      
Max request concurrency:                 not set   
Successful requests:                     100       
Benchmark duration (s):                  1884.05   
Total input tokens:                      32681     
Total input text tokens:                 32681     
Total generated tokens:                  25126     
Total generated tokens (retokenized):    25116     
Request throughput (req/s):              0.05      
Input token throughput (tok/s):          17.35     
Output token throughput (tok/s):         13.34     
Peak output token throughput (tok/s):    28.00     
Peak concurrent requests:                6         
Total token throughput (tok/s):          30.68     
Concurrency:                             1.12      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   21191.11  
Median E2E Latency (ms):                 15967.27  
P90 E2E Latency (ms):                    51951.98  
P99 E2E Latency (ms):                    67537.33  
---------------Time to First Token----------------
Mean TTFT (ms):                          3001.57   
Median TTFT (ms):                        192.73    
P99 TTFT (ms):                           34416.67  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          72.82     
Median TPOT (ms):                        72.81     
P99 TPOT (ms):                           76.01     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           72.68     
Median ITL (ms):                         72.16     
P95 ITL (ms):                            79.67     
P99 ITL (ms):                            86.69     
Max ITL (ms):                            316.28    
==================================================
[OK] RR=0.05 done -> /root/autodl-tmp/workspace/experiment/results/sglang/qwen3.5-122b/20260405_123855_sglang/rr_0.05/result.json

>>> ============================================
>>> Benchmark RR=0.06 req/s
>>> ============================================